### ML for Flask

In [89]:
import pickle
import pandas as pd
import numpy as np
xgb_model_min_loaded = pickle.load(open('ny_min_xgb_model_min.pickle', "rb"))
xgb_model_max_loaded = pickle.load(open('ny_max_xgb_model_min.pickle', "rb"))


sel_features = ['rating','.Net', 'AI', 'AWS', 'Azure', 'Big Data', 'Business Intelligence',
                'C/C++', 'Data Analysis', 'Data Science', 'Data Warehouse', 'Excel',
                'Git', 'HBase', 'Hadoop', 'Hive', 'Java', 'JavaScript', 'Kafka',
                'Linux', 'MATLAB', 'Machine Learning', 'Microsoft Office',
                'Microsoft SQL Server', 'MongoDB', 'MySQL', 'Natural Language Processing',
                'NoSQL', 'Oracle', 'Perl', 'Pig', 'PostgreSQL', 'Project Management',
                'Python', 'R', 'S3', 'SAS', 'SPSS', 'SQL', 'Scala', 'Scripting',
                'Shell Scripting', 'Software Development', 'Spark', 'Tableau', 'TensorFlow']

def nyc_salary_with_skills(rating,inputs_list):
    sample_list = [0] * (len(sel_features))
    input_X = pd.DataFrame([sample_list],
                               columns=list(sel_features))
    for inputs in inputs_list:
        if inputs in list(input_X.columns):
            input_X[inputs] = 1
    input_X['rating'] = float(rating)
    salary = (int(xgb_model_min_loaded.predict(input_X[:1])), int(xgb_model_max_loaded.predict(input_X[:1])))
    return salary

In [90]:
skill_money = {}
skill_money_list = []
for skill in sel_features[1:]:
    skill_money['skill'] = skill
    skill_money['salary'] = NYC_salary_with_skills(3.6, [skill])
    skill_money_list.append(skill_money)
    skill_money = {}
single_skill = pd.DataFrame(skill_money_list).sort_values('salary', ascending=False)

In [91]:
def nyc_salary_with_skills_and(rating, inputs_list):

    sample_list = [0] * (len(sel_features))
    input_x = pd.DataFrame([sample_list],
                           columns=list(sel_features))

    for inputs in inputs_list:
        if inputs in list(input_x.columns):
            input_x[inputs] = 1
    input_x['rating'] = float(rating)
    salary_min = int(xgb_model_min_loaded.predict(input_x))
    salary_max = int(xgb_model_max_loaded.predict(input_x))

    # suggest skill with more salary
    suggest_list = []
    all_list = inputs_list

    for skill in single_skill['skill'][:10]:
        if skill not in inputs_list:
            suggest_list.append(skill)

        suggest_list_salary = {}
        suggest_list_salary_list = []
        for skill in suggest_list:
            all_list = []
            all_list = inputs_list + [skill]
            suggest_list_salary['skill'] = skill
            suggest_list_salary['salary'] = int(np.subtract(nyc_salary_with_skills(rating, all_list),
                                                            nyc_salary_with_skills(rating, inputs_list)).mean())
            suggest_list_salary_list.append(suggest_list_salary)
            suggest_list_salary = {}
    suggest_skills = pd.DataFrame(suggest_list_salary_list).sort_values('salary', ascending=True)
    suggest_skills = suggest_skills[suggest_skills['salary'] > 0]
    suggest_skills.columns = ['Skill', 'Salary_Increase']
    return {'Min_Salary': salary_min, 'Max_Salary': salary_max, 'Suggest_Skills': suggest_skills}

In [92]:
NYC_salary_with_skills_and(3.6,['MySql','R','Tableau','Python'])

{'Min_Salary': 66400,
 'Max_Salary': 75639,
 'Suggest_Skills':                   Skill  Salary increase by $
 4    Project Management                 28649
 0          Data Science                 22929
 1  Microsoft SQL Server                 21086
 2                    AI                 17598
 3            TensorFlow                 13513
 8                MATLAB                 11232
 5                  Hive                  7607
 6                   SAS                  1298}

### Viz for Flask

In [67]:
inputs_list = ['MySql','Tableau','Python']
rating = 3.6

In [60]:
NYC_salary_with_skills_and(rating,input_list)

{'Min_Salary': 66400,
 'Max_Salary': 75639,
 'Suggest_Skills':                   Skill  Salary increase by $
 4    Project Management                 28649
 0          Data Science                 22929
 1  Microsoft SQL Server                 21086
 2                    AI                 17598
 3            TensorFlow                 13513
 8                MATLAB                 11232
 5                  Hive                  7607
 6                   SAS                  1298}

In [96]:
import pandas as pd
import numpy as np
import pyecharts
from pyecharts import options as opts
df_single_skill_rank = pd.read_csv('skills_ranking.csv',header=None)
df_single_skill_rank.columns = ['skill','count']

In [97]:
df_single_skill_rank['Ratio(%)'] = round((df_single_skill_rank['count'] / 44598)*100,2)
df_single_skill_rank[df_single_skill_rank['skill'].isin(inputs_list)]

     skill  count  Ratio(%)
0   Python   3325      7.46
7  Tableau   1236      2.77

In [106]:
def nyc_salary_with_skills_AVG(rating,inputs_list):
    sample_list = [0] * (len(sel_features))
    input_X = pd.DataFrame([sample_list],
                               columns=list(sel_features))
    for inputs in inputs_list:
        if inputs in list(input_X.columns):
            input_X[inputs] = 1
    input_X['rating'] = float(rating)
    salary = ((int(xgb_model_min_loaded.predict(input_X[:1]))+int(xgb_model_max_loaded.predict(input_X[:1])))/2)
    return salary

In [110]:
skill_money = {}
skill_money_list = []
for skill in sel_features[1:]:
    skill_money['skill'] = skill
    skill_money['salary'] = nyc_salary_with_skills_AVG(3.6, [skill])
    skill_money_list.append(skill_money)
    skill_money = {}
single_skill_avg = pd.DataFrame(skill_money_list).sort_values('salary', ascending=False)
single_skill_avg = single_skill_avg.reset_index(drop=True)
single_skill_avg.head()

                  skill   salary
0          Data Science  90594.0
1  Microsoft SQL Server  85452.0
2                    AI  82311.0
3    Project Management  81734.0
4               Tableau  79160.5

In [112]:
df_single_skill_rank

                skill  count  Ratio(%)
0              Python   3325      7.46
1                 SQL   3104      6.96
2    Machine Learning   2297      5.15
3                   R   2234      5.01
4              Hadoop   1714      3.84
..                ...    ...       ...
459            TestNG      1      0.00
460           UltiPro      1      0.00
461       Wireframing      1      0.00
462              Xero      1      0.00
463          openSUSE      1      0.00

[464 rows x 3 columns]

In [117]:
# single_skill_info = single_skill_avg.join(df_single_skill_rank.set_index('skill'), on='skill')
# single_skill_info.to_csv('single_skill_info.csv')

In [124]:
single_skill_info = pd.read_csv('single_skill_info.csv',index_col=0)
single_skill_info

                          skill   salary  count  Ratio(%)
0                  Data Science  90594.0    249      0.56
1          Microsoft SQL Server  85452.0    476      1.07
2                            AI  82311.0    479      1.07
3            Project Management  81734.0    220      0.49
4                       Tableau  79160.5   1236      2.77
5                           SAS  75058.5    941      2.11
6                         Spark  74107.5   1531      3.43
7                    TensorFlow  73984.5    465      1.04
8                        MATLAB  73759.0    418      0.94
9                           SQL  70463.0   3104      6.96
10                         Hive  70267.5    966      2.17
11                Data Analysis  66303.0    448      1.00
12                    Scripting  65937.5    377      0.85
13  Natural Language Processing  65310.5    570      1.28
14                        MySQL  65203.5    283      0.63
15                     Big Data  63791.5    916      2.05
16                            R  63506.5   2234      5.01
17                        HBase  62266.5    307      0.69
18              Shell Scripting  62039.5    261      0.59
19                         .Net  61407.5    221      0.50
20                          Pig  61104.5    349      0.78
21             Machine Learning  60015.5   2297      5.15
22                        Kafka  59568.0    456      1.02
23                         Perl  58978.5    283      0.63
24                       Oracle  58973.0    526      1.18
25             Microsoft Office  58159.5    383      0.86
26                         SPSS  56738.0    278      0.62
27                          AWS  56587.0    883      1.98
28                       Python  55715.0   3325      7.46
29                       Hadoop  55223.0   1714      3.84
30                         Java  54696.0   1480      3.32
31                   PostgreSQL  53490.0    289      0.65
32         Software Development  53424.0    271      0.61
33               Data Warehouse  53006.0    520      1.17
34                        Azure  52644.0    442      0.99
35                           S3  51531.5    195      0.44
36        Business Intelligence  51413.0    201      0.45
37                        Linux  50945.0    490      1.10
38                        Scala  50802.5    837      1.88
39                        Excel  47331.5    331      0.74
40                      MongoDB  41772.5    237      0.53
41                        NoSQL  38333.0    607      1.36
42                        C/C++  31277.0    577      1.29
43                   JavaScript  28641.5    309      0.69
44                          Git  22138.0    336      0.75

In [114]:
single_skill_info[single_skill_info['skill'].isin(inputs_list)]

      skill   salary  count  Ratio(%)
4   Tableau  79160.5   1236      2.77
28   Python  55715.0   3325      7.46